/**
 * \mainpage
 * # Лабораторна робота №8
 *
 * \author Панкеєв Владислав Олексійович
 * \date 27-11-2022
 */
 /*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу,
виклики функцій   lab5, lab6.
*/

#include <stdio.h>

	void lab5();

	void lab6();

 /** Головна функція 
 
     Послідовність дій
- Створити 2 функції та не присвоювати ніякий тип данних
\Створюємо 2 функції з форматом void(грубо кажучи без зворотнього відгуку)*/


	int main() 
	{
    	lab5();
    
    	lab6();
	}

/** 
- Виклик другорядних функцій lab5 та lab6, які містять коди программ для розрахунків
*/

void lab5()
{
/**  

a - число яке буде вважатися початком діапазону.


b - число яке буде вважатися кінцем діапазону.

k - лічильник який буде збільшуватися на 1, при успішному виконанні умови.


*/


    int a, b, k = 0;
    printf("Введіть початок діапозону:");
    scanf("%d", &a);
    
    printf("Введіть кінець діапозону:");
    scanf("%d", &b);
    
/** Продовжуємо додавати до числа а по 1. до тих пір. поки виконується умова. */    
    
    for (int iterator = a + 1; iterator < b; iterator ++){ 
    
/** Робимо перевірку чи є наше число парним. якщо так. додаємо до нашого лічильника 1 */
    
        if (iterator % 2 == 0){ 
            k++;
        }
    }
    
    printf("Кількість парних чисел в цьому діапазоні = %d\n", k);
}

void lab6()
{

/**
 - Вводимо масив у вигляді слова.
 - Зразу відімайомо від його розміру 1, через те що, у кінці кожного символьного масиву машина ставить 0, для машини це своєрідна крапка. Абоє інакше кажучи. прибрати ітеруючий 0.
*/

    char words[] = "lvanov";  
    int size = sizeof(words)-1; 
    printf("Array size: %i\n", size);
    for(int i = 0; i<size/2;i++)
    {
    
/** Створюємо тимчасову змінну для зберігання символа, а потім для його заміни. */    
    
       	char temp = words[i]; 
       	
/** Перезаписуємо значення одного символа значенням другого символа. */       	
       	
       	words[i] = words[size/2+i];
       	
/** Перезаписуємо значення другого символа значенням першого символа який ми відклали до тимчасової змінної. */       	
       	 
       	words[size/2+i] = temp;
    }
    
    printf("%s\n", words);
}
